/*▄────────────────────────────────────▄
  █                                    █
  █  Entrypoint                        █
  █  • Коллекция точек входа           █
  █                                    █
  █  (присвоение только через скобки)  █
  █                                    █
  ▀────────────────────────────────────▀*/
(() => {
/*┌─────────────────────────────┐
  │ Список локальных переменных │
  └─────────────────────────────┘*/
    let _collection = null; // Единая коллекция
    let _collections = {};  // Список коллекций
    
/*┌────────────────────────────────────────┐
  │ Очищает все коллекции (сборщик мусора) │
  └────────────────────────────────────────┘*/
    $.gc.entrypoint = () => {
        _collection = null; // Единая коллекция
        _collections = {};  // Список коллекций
    };
    
/*┌──────────────────────────────────┐
  │ Добавляет новую единую коллекцию │
  └──────────────────────────────────┘*/
    $.Entrypoint = new Proxy((callback) => {
        _collection = callback;
    },
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новую коллекцию в список коллекций │
  └──────────────────────────────────────────────┘*/
    {get: (target, collection) => (callback) => {
        _collections[collection] = callback;
    }});
    
/*┌────────────────────────────────────┐
  │ Выполняет элемент единой коллекции │
  └────────────────────────────────────┘*/
    $.entrypoint = new Proxy((...args) => {
        return _collection(...args);
    },
    
/*┌─────────────────────────────────────────────────┐
  │ Выполняет элемент коллекции из списка коллекций │
  └─────────────────────────────────────────────────┘*/
    {get: (target, collection) => (...args) => {
        return _collections[collection](...args);
    }});
    
/*┌────────────────────────────────────┐
  │ Выполняет элемент единой коллекции │
  └────────────────────────────────────┘*/
    Object.defineProperty(global, 'entrypoint', {
        get: () => $.entrypoint(...process.argv.slice(2)),
        set: callback => callback(...process.argv.slice(2))
    });
})();
