/*▄───────────────────────────────────────────▄
  █                                           █
  █  Entrypoint                               █
  █  • Коллекция точек входа                  █
  █                                           █
  █  (присвоение через равенство или скобки)  █
  █                                           █
  ▀───────────────────────────────────────────▀*/
(() => {
/*┌─────────────────────────────┐
  │ Список локальных переменных │
  └─────────────────────────────┘*/
    let _collection = null; // Единая коллекция
    let _collections = {};  // Список коллекций
    
/*┌────────────────────────────────────────┐
  │ Очищает все коллекции (сборщик мусора) │
  └────────────────────────────────────────┘*/
    $.gc.entrypoint = () => {
        _collection = null; // Единая коллекция
        _collections = {};  // Список коллекций
    };
    
/*┌──────────────────────────────────┐
  │ Добавляет новую единую коллекцию │
  └──────────────────────────────────┘*/
    let _single = (callback) => {
        _collection = callback;
    };
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новую коллекцию в список коллекций │
  └──────────────────────────────────────────────┘*/
    let _several = (collection, callback) => {
        _collections[collection] = callback;
    };
    let _proxy = new Proxy(_single, {
    // Присвоение через функцию
        get: (target, collection) => (callback) => _several(collection, callback),
        
    // Присвоение через равенство
        set: (target, collection, callback) => _several(collection, callback)
    });
    Object.defineProperty($, 'Entrypoint', {
        get: f=>_proxy, // Присвоение через функцию
        set: _single    // Присвоение через равенство
    });
    
/*┌────────────────────────────────────┐
  │ Выполняет элемент единой коллекции │
  └────────────────────────────────────┘*/
    $.entrypoint = new Proxy((...args) => {
        return _collection(...args);
    },
    
/*┌─────────────────────────────────────────────────┐
  │ Выполняет элемент коллекции из списка коллекций │
  └─────────────────────────────────────────────────┘*/
    {get: (target, collection) => (...args) => {
        return _collections[collection](...args);
    }});
    
/*┌────────────────────────────────────┐
  │ Выполняет элемент единой коллекции │
  └────────────────────────────────────┘*/
    Object.defineProperty(global, 'entrypoint', {
        get: () => $.entrypoint(...process.argv.slice(2)),
        set: callback => callback(...process.argv.slice(2))
    });
})();
