/*▄────────────────────▄
  █                    █
  █  Загрузка модулей  █
  █                    █
  ▀────────────────────▀*/
require('core'); // Ядро

/*▄───────────────────────────────▄
  █                               █
  █  Очищает все сборщики мусора  █
  █                               █
  ▀───────────────────────────────▀*/
$.gc=f=>Object.values($.gc).forEach(callback => callback());

/*▄────────────────────────▄
  █                        █
  █  Работа с MVC-моделью  █
  █                        █
  ▀────────────────────────▀*/
// Присвоение через равенство или скобки
require('./total.entrypoint'); // Коллекция точек входа
require('./total.text');       // Коллекция текстов
require('./total.mvc');        // Архитектура проектирования (MVC-модель)
